<template>
    <!-- Минимум стилей   -->
    <div :class="$style.home">
        <h1 :class="$style.title">О проекте (основное):</h1>
        <ul :class="$style.list">
            <li>
                <h3 :class="$style.listTitle">Аутентификация и авторизация:</h3>
                <p :class="$style.listItemText">
                    Для аутентификации и авторизации на стороне сервера используется Sanctum. Данные проходят
                    валидацию на сервере, а информация об ошибках выводится в форме аутентификации. Время жизни токена
                    устанавливается на сервере.
                </p>
            </li>
            <li>
                <h3 :class="$style.listTitle">Корзина:</h3>
                <p :class="$style.listItemText">
                    Для авторизированных пользователей данные корзины сохраняются в БД, а для неавторизованных
                    пользователей в localStorage. В любой момент можно изменить количество товара на странице корзины, в
                    предосмотре товарв, на странице товара и на карточке товара, там же можно удалить товар из корзины.
                </p>
            </li>
            <li>
                <h3 :class="$style.listTitle">Фильтрация и сортировка</h3>
                <p :class="$style.listItemText">
                    На странице категории загружаются данные фильтра для соответствующей категории и ее дочерних
                    категорий, также формируется атрибут для фильтрации товаров по цене (с сервера приходит
                    информация о максимальной и минимальной цене товаров, при выбранных опциях фильтра). Возле
                    каждой опции атрибута фильтра отображается сколько товаров будет найдено, при выборе
                    этой опции, с учетем уже выбранных опций, если это количество равно нулю, то сервер отфильтрует эти
                    опции и атрибуты. Если на сервер придут данные атрибута для фильтрации товаров, котого нет в фильтре
                    (для этой категории и ее вложенных), то они будут проигнорированны.
                    Для сортировки товаров необходимо выбрать соответствующую опцию в блоке
                    сортировки.
                </p>
            </li>
            <li>
                <h3 :class="$style.listTitle">Страница товара</h3>
                <p :class="$style.listItemText">
                    На странице товара отображается карусель изображений, описание и характеристики. Так же на странице товара
                    есть компонент для упраления состоянием товара в корзине.
                </p>
            </li>
            <li>
                <h3 :class="$style.listTitle">Каталог</h3>
                <p :class="$style.listItemText">
                    Каталог открывается при нажатии на соответствующую кнопку в шапке сайта или в навигационном
                    компоненте на мобильных расширениях. Категориии имеют вложенность, поэтому для отображения каталога
                    с сервера приходят категории с вложенностью менее 3, после чего они отображаются в popup каталога.
                </p>
            </li>
            <!--            <li>
                            <h3 :class="$style.listTitle">Предосмотр товара</h3>
                            <p :class="$style.listItemText">
                                У каждой карточки товара есть кнопка "Подробнее", которая при нажатии открывает всплывающее окно
                                (popup) с более подробной информацией о товаре, включая все изображения, товары из группы (в
                                планах), цену и другие детали.
                            </p>
                        </li>-->
        </ul>
    </div>
</template>

<script>
export default {
    name: "HomePageComponent",
}
</script>

<style module>
@import "HomePageComponent.module.scss";
</style>
